# Merge de 3 dataframes

In [1]:
import pandas as pd

In [2]:
path="../ficheros_curso/merge/"

In [3]:
dfPed = pd.read_csv(path+"Pedidos.txt", sep=";")
dfPed.shape

(830, 6)

In [4]:
dfEmp = pd.read_csv(path+"Empleados.txt", sep=";")
dfEmp.shape

(9, 3)

In [5]:
dfEmpr = pd.read_csv(path+"Empresas.txt", sep=";")
dfEmpr.shape

(3, 2)

In [6]:
dfTotal = pd.merge(dfPed, dfEmp, left_on="idempleado", right_on="id")
dfTotal.head()

,idpedido,cliente,idempleado,idempresa,importe,pais,id,nombre,cargo
0,10248,WILMK,5,3,32.38,Finlandia,5,Buchanan,Gerente de ventas
1,10254,CHOPS,5,2,22.98,Suiza,5,Buchanan,Gerente de ventas
2,10269,WHITC,5,1,4.56,Estados Unidos,5,Buchanan,Gerente de ventas
3,10297,BLONP,5,2,5.74,Francia,5,Buchanan,Gerente de ventas
4,10320,WARTH,5,3,34.57,Finlandia,5,Buchanan,Gerente de ventas

In [7]:
dfTotal = dfTotal.merge(dfEmpr, left_on='idempresa', right_on='id')
dfTotal.head()

,idpedido,cliente,idempleado,idempresa,importe,pais,id_x,nombre,cargo,id_y,empresa
0,10248,WILMK,5,3,32.38,Finlandia,5,Buchanan,Gerente de ventas,3,Federal Shipping
1,10320,WARTH,5,3,34.57,Finlandia,5,Buchanan,Gerente de ventas,3,Federal Shipping
2,10333,WARTH,5,3,0.59,Finlandia,5,Buchanan,Gerente de ventas,3,Federal Shipping
3,10359,SEVES,5,3,288.43,Reino Unido,5,Buchanan,Gerente de ventas,3,Federal Shipping
4,10378,FOLKO,5,3,5.44,Suecia,5,Buchanan,Gerente de ventas,3,Federal Shipping

In [8]:
dfTotal.rename(columns={"nombre":"empleado"}, inplace=True)
dfTotal.head()

,idpedido,cliente,idempleado,idempresa,importe,pais,id_x,empleado,cargo,id_y,empresa
0,10248,WILMK,5,3,32.38,Finlandia,5,Buchanan,Gerente de ventas,3,Federal Shipping
1,10320,WARTH,5,3,34.57,Finlandia,5,Buchanan,Gerente de ventas,3,Federal Shipping
2,10333,WARTH,5,3,0.59,Finlandia,5,Buchanan,Gerente de ventas,3,Federal Shipping
3,10359,SEVES,5,3,288.43,Reino Unido,5,Buchanan,Gerente de ventas,3,Federal Shipping
4,10378,FOLKO,5,3,5.44,Suecia,5,Buchanan,Gerente de ventas,3,Federal Shipping

In [9]:
dfTotal = dfTotal[['cliente','empleado','empresa','pais','importe']]
dfTotal.head()

  cliente  empleado           empresa         pais  importe
0   WILMK  Buchanan  Federal Shipping    Finlandia    32.38
1   WARTH  Buchanan  Federal Shipping    Finlandia    34.57
2   WARTH  Buchanan  Federal Shipping    Finlandia     0.59
3   SEVES  Buchanan  Federal Shipping  Reino Unido   288.43
4   FOLKO  Buchanan  Federal Shipping       Suecia     5.44

In [10]:
dfTotal.importe.groupby(dfTotal.pais)